configuration/src/Catalogs/AdditionalReportsAndDataProcessors/AdditionalReportsAndDataProcessors.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AdditionalReportsAndDataProcessors</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SafeMode</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Version</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Kind</name>
    <type>
      <types>EnumRef.AdditionalReportsAndDataProcessorsKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Information</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseForObjectForm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseForListForm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeResponsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Publication</name>
    <type>
      <types>EnumRef.AdditionalReportsAndDataProcessorsPublicationOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>SettingsStorage</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DataProcessorStorage</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>UseOptionStorage</name>
    <comment>When the Truth is that a supplementary report is attached to the storage options of &quot;Chroniclesofarefugee&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DeepIntegrationWithReportForm</name>
    <comment>When the Truth is that the report has a programmatic interface for tight integration with the General form of &quot;FormatData&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PermissionsCompatibilityMode</name>
    <type>
      <types>EnumRef.AdditionalReportsAndDataProcessorsPermissionCompatibilityModes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Commands</name>
    <attributes>
      <name>Id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StartupOption</name>
      <type>
        <types>EnumRef.AdditionalDataProcessorsCallMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ShouldShowUserNotification</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Modifier</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDScheduledJob</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Hide</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>CommandsToReplace</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>RelatedObject</name>
      <type>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Sections</name>
    <attributes>
      <name>Section</name>
      <type>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Permissions</name>
    <attributes>
      <name>PermissionKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameters</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <comment>Value</comment>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/AdditionalReportsAndDataProcessorsPublicationOptions/AdditionalReportsAndDataProcessorsPublicationOptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AdditionalReportsAndDataProcessorsPublicationOptions</name>
  <enumValues>
    <name>Used</name>
  </enumValues>
  <enumValues>
    <name>DebugMode</name>
  </enumValues>
  <enumValues>
    <name>isDisabled</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/AdditionalReportsAndDataProcessors/Forms/AdditionalReportsAndDataProcessorsCheck/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region FormCommandHandlers

&AtClient
Procedure GoToList(Command)
	Close();
	
	Filters = New Structure;
	Filters.Insert("Publication", PredefinedValue("Enum.AdditionalReportsAndDataProcessorsPublicationOptions.Used"));
	Filters.Insert("DeletionMark", False);
	Filters.Insert("IsFolder", False);
	
	FormParameters = New Structure;
	FormParameters.Insert("Filter", Filters);
	FormParameters.Insert("Representation", "List");
	FormParameters.Insert("AdditionalReportsAndDataProcessorsCheck", True);
	
	OpenForm("Catalog.AdditionalReportsAndDataProcessors.ListForm", FormParameters);
EndProcedure

&AtClient
Procedure CloseForm(Command)
	Close();
EndProcedure

&AtClient
Procedure Checked(Command)
	MarkUserTaskDone();
	Close();
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure MarkUserTaskDone()
	
	ArrayVersion  = StrSplit(Metadata.Version, ".", False);
	CurrentVersion = ArrayVersion[0] + ArrayVersion[1] + ArrayVersion[2];
	CommonSettingsStorage.Save("ToDoList", "AdditionalReportsAndDataProcessors", CurrentVersion);
	
EndProcedure

#EndRegion
